Repository: KonishchevDmitry/pyvsb
Catalog: po/*.po
Languages: ru

source: Creating tar archive for current backup failed.
ru: Создание tar архива для текущего бэкапа завершилось неудачей.

source: Backup started with configuration file '%s' at %s.
ru: Бэкап с конфигурационным файлом '%s' начат в %s.

source: Backup completed with errors at %s.
ru: Бэкап завершен с ошибками в %s.

source: Backup completed with warnings at %s.
ru: Бэкап завершился с некритическими ошибками в %s.

source: Backup successfully completed at %s.
ru: Бэкап успешно завершен в %s.

source: Maximum recursion depth exceeded while backing up file '%s'.
ru: Достигнуто максимальное количество рекурсивных вызовов функций при бэкапе файла '%s'.

source: Skipping '%s' - it is already treated.
ru: Пропускаем '%s' - он уже был обработан.

source: '%s' is matches filter '%s'.
ru: '%s' подходит под фильтр '%s'.

source: Skipping '%s' - it has been filtered.
ru: Пропускаем '%s' - он был отфильтрован.

source: Skipping '%s' - it has been filtered by default filter.
ru: Пропускаем '%s' - он был отфильтрован фильтром по умолчанию.

source: Backing up '%s'...
ru: Бэкапим '%s'...

source: Can't read directory '%s': %s.
ru: Ошибка при чтении директории '%s': %s.

source: Backing up of '%s' failed.
ru: Бэкап '%s' завершился неудачей.

source: No files added to backup archive. Backup is empty. Not adding it to the current group.
ru: Ни одного файла не было добавлено в архив бэкапа. Бэкап пуст. Не добавляем его в текущую группу.

source: Creating backup data archive failed.
ru: Создание архива с данными бэкапа завершилось неудачей.

source: Not all backup files has been written. Backup is not full.
ru: Были записаны не все файлы бэкапа. Бэкап будет не полным.

source: All backup files has been written.
ru: Все файлы бэкапа были успешно записаны.

source: Maximum recursion depth exceeded while creating empty directory tree.
ru: Максимальное количество рекурсивных вызовов функций было достигнуто при создании пустого дерева каталогов.

source: Error while creating empty directory tree: '%s' is not directory or link to directory.
ru: Ошибка при создании пустого дерева каталогов: '%s' - не директория и не ссылка на директорию.

source: '%s' was a directory, but now it is link to '%s'. Rejecting link creation.
ru: '%s' была директорией, но сейчас это ссылка на '%s'. Пропускаем создание ссылки.

source: '%s' was link to '%s', but now it is a directory. Rejecting directory creation.
ru: '%s' была ссылкой на '%s', но сейчас это директория. Пропускаем создание директории.

source: '%s' was link to '%s', but now it is link to '%s'. Rejecting link changing.
ru: '%s' была ссылкой на '%s', но сейчас это ссылка на '%s'. Пропускаем изменение ссылки.

source: Logical error!
ru: Логическая ошибка!

source: Cycle paths detected at '%s' while creating empty directory tree.
ru: При создании пустого дерева каталогов были обнаружены закольцованные пути при обработке пути '%s'.

source: '%s' is not a directory or a link to directory.
ru: '%s' - не директория и не ссылка на директорию.

source: Running backup entry '%s' start_before command '%s'...
ru: Запускаем для элемента бэкапа '%s' start_before команду '%s'...

source: Backup entry '%s' start_before command return exit status %d. Shell output: %s
ru: start_before команда элемента бэкапа '%s' возвратила статус завершения %d. Вывод командной оболочки: %s

source: Creating empty directory tree for backup entry '%s' failed.
ru: Создание пустого дерева каталогов для элемента бэкапа '%s' завершилось неудачей.

source: Backup of backup entry '%s' failed.
ru: Бэкап элемента бэкапа '%s' завершился неудачей.

source: Running backup entry '%s' start_after command '%s'...
ru: Запускаем для элемента бэкапа '%s' start_after команду '%s'...

source: Backup entry '%s' start_after command return exit status %d. Shell output: %s
ru: start_after команда элемента бэкапа '%s' возвратила статус завершения %d. Вывод командной оболочки: %s

source: Can't read file '%s': %s.
ru: Ошибка при чтении файла '%s': %s.

source: Can't open temp file '%s' for writing: %s.
ru: Не удалось открыть временный файл '%s' на запись: %s.

source: File type of '%s' has been changed.
ru: Тип файла '%s' изменился.

source: Error while copying file '%s' to '%s': %s.
ru: Ошибка при копировании файла '%s' в '%s': '%s'.

source: Getting temp storage file info failed.
ru: Получение информации о временном файле архива завершилось неудачей.

source: Sending email report...
ru: Отправляем email отчет...

source: Getting unique files list for backup '%s' in group '%s'...
ru: Получаем список уникальных файлов для бэкапа '%s' в группе '%s'...

source: Bad unique files list line in '%s': '%s'.
ru: Неверная строка в списке уникальных файлов '%s': '%s'.

source: Unique files list '%s' is broken! It is not ending by empty line. Skiping it's last line.
ru: Список уникальных файлов '%s' поврежден! Он не заканчивается пустой строкой. Пропускаем последнюю его строку.

source: Can't read unique files list '%s': %s.
ru: Ошибка при чтении списка уникальных файлов '%s': %s.

source: Bad backup '%s': it is not exists.
ru: Неверный бэкап '%s': такого файла или директории не существует.

source: Bad backup '%s': it is not a directory.
ru: Неверный бэкап '%s': это не директория.

source: '%s' is not a backup root.
ru: '%s' - не корневая директория бэкапа.

source: Bad backup root: '%s' is not a directory.
ru: Неверная корневая директория бэкапа: '%s' - не директория.

source: Backup root directory is not exists. Creating it...
ru: Корневая директория бэкапа не существует. Создаем ее...

source: Creating backup root directory failed.
ru: Создание корневой директории бэкапа завершилось неудачей.

source: Backup root directory '%s' is not exists.
ru: Корневой каталог бэкапа '%s' не существует.

source: Bad backup root directory '%s'.
ru: Неверный корневой каталог бэкапа '%s'.

source: Finalizing current backup failed.
ru: Запись файлов текущего бэкапа завершилась неудачей.

source: Creating current backup directory failed.
ru: Создание директории для текущего бэкапа завершилось неудачей.

source: Bad backup temp directory: '%s' is not a directory.
ru: Неверная временная директория бэкапа: '%s' - не директория.

source: Creating backup temp directory '%s' failed.
ru: Создание временной директории бэкапа '%s' завершилось неудачей.

source: Current group is broken! Removing it...
ru: Текущая группа повреждена! Удаляем ее...

source: Finalizing current group to '%s'...
ru: Завершаем формирование текущей группы, перемещая ее в '%s'...

source: Finalizing current group failed.
ru: Не удалось завершить формирование текущей группы.

source: Bad extern files list line in '%s': '%s'.
ru: Неверная строка в списке внешних файлов '%s': '%s'.

source: Extern files list '%s' is broken! It is not ending by empty line. Skiping it's last line.
ru: Список внешних файлов '%s' поврежден! Он не заканчивается пустой строкой. Пропускаем последнюю его строку.

source: Can't read extern files list '%s': %s.
ru: Ошибка при чтении списка внешних файлов '%s': %s.

source: Can't read group '%s' directory '%s': %s.
ru: Ошибка при чтении директории группы '%s' ('%s'): %s.

source: Getting group '%s' backups list failed.
ru: Получение списка бэкапов группы '%s' завершилось неудачей.

source: Bad backup '%s' in group '%s'.
ru: Неверный бэкап '%s' в группе '%s'.

source: Getting group '%s' unique files list failed.
ru: Получение списка уникальных файлов группы '%s' завершилось неудачей.

source: Trying to lock backup root...
ru: Пытаемся заблокировать корневую директорию бэкапа...

source: Can't lock backup root '%s': can't create (open) lock file '%s' (%s).
ru: Не удалось заблокировать корневую директорию бэкапа '%s': не удалось создать (открыть) файл блокировки '%s' (%s).

source: Can't lock file '%s': %s.
ru: Не удалось заблокировать файл '%s': %s.

source: Can't lock backup root '%s': backing up or restoring is already started by another process.
ru: Не удалось заблокировать корневую директорию бэкапа '%s': бэкап или восстановление уже запущены другим процессом.

source: Backup root locked.
ru: Корневая директория бэкапа заблокирована.

source: Removing backup temp directory '%s' failed.
ru: Удаление временной директории бэкапа '%s' завершилось неудачей.

source: Removing group '%s'...
ru: Удаляем группу '%s'...

source: Removing group '%s' failed.
ru: Удаление группы '%s' завершилось неудачей.

source: Can't read backup root directory '%s': %s.
ru: Ошибка при чтении корневой директории '%s': %s.

source: Bad group '%s' in backup root directory '%s'.
ru: Неверная группа '%s' в корневой директории бэкапа '%s'.

source: Gotten backup groups list: %s.
ru: Полученный список групп: %s.

source: Removing old groups...
ru: Удаляем старые группы...

source: Removing old groups failed.
ru: Удаление старых групп завершилось неудачей.

source: Can't write backup extern files info to '%s': %s.
ru: Ошибка при записи информации о внешних файлах в '%s': %s.

source: Can't write backup unique files info to '%s': %s.
ru: Ошибка при записи информации об уникальных файлах в '%s': %s.

source: Can't write backup log file '%s': %s.
ru: Ошибка при записи лога в '%s': %s.

source: Configuration file error:
ru: Ошибка конфигурационного файла:

source: Python module ConfigObj is not installed. Please install it.
ru: Python'овский модуль ConfigObj не установлен. Пожалуйста, установите его.

source: Configuration file error: %s
ru: Ошибка конфигурационного файла: %s

source: %s '%s' value '%s' is not an absolute path.
ru: %s значение опции '%s' ('%s') - не абсолютный путь.

source: %s bad '%s' value '%s'. Allowed values: %s.
ru: %s неверное значение опции '%s': '%s'. Допустимые значения: %s.

source: %s bad '%s' value '%s'.
ru: %s неверное значение опции '%s': '%s'.

source: %s bad '%s' value: it can't be a multiline string.
ru: %s неверное значение опции '%s' - оно не может быть многострочным.

source: %s bad '%s' type.
ru: %s неверный тип опции '%s'.

source: %s backup entry path '%s' is not an absolute path.
ru: %s путь элемента бэкапа '%s' - не абсолютный путь.

source: %s bad '%s' value '%s' for backup entry '%s'. Allowed values: %s.
ru: %s неверное значение опции '%s' ('%s') для элемента бэкапа '%s'. Допустимые значения: %s.

source: %s bad filter regex string for backup entry '%s': '%s'.
ru: %s неверное регулярное выражение для фильтра элемента бэкапа '%s': '%s'.

source: %s bad filter string for backup entry '%s': '%s'.
ru: %s неверная строка фильтра для элемента бэкапа '%s': '%s'.

source: %s bad '%s' type for backup entry '%s'.
ru: %s неверный тип опции '%s' для элемента бэкапа '%s'.

source: %s unknown option '%s' in backup entry '%s'.
ru: %s неизвестная опция '%s' в элементе бэкапа '%s'.

source: %s unknown option '%s'.
ru: %s неизвестная опция '%s'.

source: Backup config dump: %s
ru: Дамп переменных конфига: %s

source: %s 'backup_root' option not found in config. It must exists.
ru: %s опция 'backup_root' не найдена в конфигурационном файле, но это обязательная опция.

source: %s no backup entries found in config. At least one must exists.
ru: %s конфигурационный файл не содержит ни одного элемента бэкапа. Каждый конфигурационный файл должен содержать хотя бы один элемент бэкапа.

source: %s option 'send_email_report' set to true, but 'mail_to' option is not set.
ru: %s опция 'send_email_report' установлена в true, но опция 'mail_to' не установлена.

source: %s option 'send_email_report' set to true, but 'mail_program' option is not set.
ru: %s опция 'send_email_report' установлена в true, но опция 'mail_program' не установлена.

source: Can't get '%s' absolute path: %s.
ru: Не удалось получить абсолютный путь '%s': %s.

source: E: Formatting log for output failed with Unicode conversion error: %s.
ru: E: Форматирование лога для последующего вывода завершилось ошибкой преобразования в Unicode: %s.

source: Can't chmod '%s': %s.
ru: Не удалось изменить права доступа '%s': %s.

source: Can't decompress file '%s' - it is not *.bz2 or *.gz file.
ru: Ошибка при распаковке файла '%s' - это не *.bz2 или *.gz файл.

source: Error while reading compressed file '%s': %s.
ru: Ошибка при чтении запакованного файла '%s': %s.

source: Can't create file '%s': %s.
ru: Ошибка при создании файла '%s': %s.

source: Error while copying file '%s' to '%s'. '%s': %s.
ru: Ошибка при копировании файла '%s' в '%s'. '%s': %s.

source: Can't close file '%s': %s.
ru: Не удалось закрыть файл '%s': %s.

source: Decompressing of file '%s' failed.
ru: Распаковка сжатого файла '%s' завершилась неудачей.

source: Can't stat '%s': %s.
ru: Ошибка при получении информации о файле '%s': %s.

source: Can't create directory '%s': %s.
ru: Ошибка при создании директории '%s': %s.

source: Can't create temp directory in '%s': %s.
ru: Ошибка при создании временной директории в '%s': %s.

source: Can't create temp directory: %s.
ru: Ошибка при создании временной директории: %s.

source: Can't create temp file in '%s': %s.
ru: Ошибка при создании временного файла в '%s': %s.

source: Can't create temp file: %s.
ru: Ошибка при создании временного файла: %s.

source: Can't move '%s' to '%s': %s.
ru: Не удалось переместить '%s' в '%s': %s.

source: Can't rename '%s' to '%s': %s.
ru: Ошибка при переименовании '%s' в '%s': %s.

source: Can't delete '%s': %s.
ru: Не удалось удалить '%s': %s.

source: Deleting of '%s' failed.
ru: Удаление '%s' завершилось неудачей.

source: Running command '%s'...
ru: Запускаем команду '%s'...

source: Can't create a pipe: %s.
ru: Ошибка при создании pipe: %s.

source: Running command '%s' failed: %s.
ru: Запуск команды '%s' завершился ошибкой '%s'.

source: Can't write data to process stdin: %s.
ru: Ошибка при записи данных в стандартный поток ввода процесса: %s.

source: Can't close command '%s' stdin pipe descriptor: %s.
ru: Ошибка при закрытии дескриптора стандартного потока ввода для команды '%s': %s.

source: Killing started command process...
ru: Завершаем процесс запущенной команды...

source: Error! Can't get command '%s' output: %s.
ru: Ошибка! Не удалось получить вывод запущенной команды '%s': %s.

source: Command '%s' exit status: %d.
ru: Статус завершения команды '%s': %d.

source: Running command '%s' failed.
ru: Запуск команды '%s' завершился неудачей.

source: Sending email message from '%s' to '%s' by email program '%s'...
ru: Отсылаем email сообщение от '%s' на '%s' при помощи email программы '%s'...

source: Can't create email message: %s
ru: Ошибка при создании email сообщения: %s.

source: Sending email message failed. Email program return exit status %d. Shell output: %s
ru: Не удалось отослать email сообщение. Email программа возвратила статус завершения %d. Вывод командной оболочки: %s

source: Sending email message failed.
ru: Не удалось отослать email сообщение.

source: Email message has been sent.
ru: Email сообщение было успешно отправлено.

source: Can't delete file '%s': %s.
ru: Ошибка при удалении файла '%s': %s.

source: Removing '%s' failed.
ru: Удаление '%s' завершилось неудачей.

source: Program has been interrupted by SIGINT.
ru: Программа была прервана сигналом SIGINT.

source: ${program_name} ${program_version} Copyright (c) ${copyright_years} Konishchev Dmitry Usage: ${program_command_name} [OPTIONS] [PATH] Options: -r, --restore - restore mode -d, --debug - show debug messages -h, --help - show this help --version - show program version Examples: # Create backup with default configuration file (${default_config}) ${program_command_name} # Create backup with configuration file example.cfg ${program_command_name} example.cfg # Restore backup '~/backups/current/2008.08.04_23.31.47' # to ./2008.08.04_23.31.47 ${program_command_name} -r ~/backups/current/2008.08.04_23.31.47 Files: ${default_config} - default configuration file.
ru: ${program_name} ${program_version} Copyright (c) ${copyright_years} Конищев Дмитрий Использование: ${program_command_name} [OPTIONS] [PATH] Опции: -r, --restore - режим восстановления -d, --debug - отображать отладочные сообщения -h, --help - вывести данное сообщение --version - вывести версию программы Примеры: # Создает бэкап, используя конфигурационный файл по умолчанию (${default_config}) ${program_command_name} # Создает бэкап с конфигурационным файлом example.cfg ${program_command_name} example.cfg # Восстанавливает бэкап '~/backups/current/2008.08.04_23.31.47' # в ./2008.08.04_23.31.47 ${program_command_name} -r ~/backups/current/2008.08.04_23.31.47 Файлы: ${default_config} - конфигурационный файл по умолчанию.

source: Starting backup mode...
ru: Запускаем режим бэкапа...

source: Backup with configuration file '%s' failed.
ru: Бэкап с конфигурационным файлом '%s' завершился неудачей.

source: Starting restore mode...
ru: Запускаем режим восстановления...

source: Restoring of '%s' failed.
ru: Восстановление '%s' завершилось неудачей.

source: Usage: %s -h
ru: Использование: %s -h

source: Deleting temporary files...
ru: Удаляем временные файлы...

source: Restoring of backup extern files will be impossible.
ru: Восстановление внешних файлов бэкапа будет невозможно.

source: Opening archive with backup data for restoring backup '%s' in group '%s' failed.
ru: Открытие архива с данными восстанавливаемого бэкапа '%s' в группе '%s' завершилось ошибкой.

source: Restoring of file '%s' failed.
ru: Восстановление файла '%s' завершилось неудачей.

source: File '%s' is marked as extern. Skipping restoring of it...
ru: Файл '%s' помечен как внешний. Пропускаем его восстановление...

source: Backup is broken: file '%s' is link to extern file, but extern files list has not info about it. Skipping restoring of it.
ru: Бэкап поврежден: файл '%s' - ссылка на внешний файл, но список внешних файлов не содержит информации о нем. Пропускаем данный файл.

source: Can't find extern file for '%s'. Skipping restoring of it.
ru: Ошибка! Не удалось найти внешний файл для файла '%s'. Пропускаем данный файл.

source: Adding extern file '%s' for '%s' from backup '%s' to temp storage...
ru: Добавляем внешний файл '%s' для '%s' из бэкапа '%s' во временный архив...

source: Opening archive with backup data for backup '%s' in group '%s' failed.
ru: Не удалось открыть архив с данными бэкапа '%s' группы '%s'.

source: Extern file '%s' for '%s' is located in unavailable archive for backup '%s'.
ru: Внешний файл '%s' для '%s' находится в недоступном архиве для бэкапа '%s'.

source: Backup '%s' is broken: it has file '%s', but this file is not exists in backup data archive.
ru: Бэкап '%s' поврежден: он имеет файл '%s', но архив с данными бэкапа не содержит этот файл.

source: File '%s' is link to extern file '%s' in backup '%s' which is not a regular file.
ru: Файл '%s' - ссылка на внешний файл '%s' бэкапа '%s', который не является обычным файлом.

source: Restoring '%s' from extern file failed.
ru: Восстановление '%s' из внешнего файла завершилось ошибкой.

source: Restoring '%s' to '%s'...
ru: Восстанавливаем '%s' в '%s'...

source: Creating temp tar storage failed.
ru: Создание временного архива завершилось ошибкой.

source: Adding all needed files to temp storage...
ru: Добавляем все необходимые файлы во временный архив...

source: Extracting files from temp storage to '%s'...
ru: Распаковываем все файлы из временного архива в '%s'...

source: Restoring completed with errors.
ru: Восстановление завершилось с ошибками.

source: Restoring completed with warnings.
ru: Восстановление завершилось с некритическими ошибками.

source: Restoring successfully completed.
ru: Восстановление успешно завершено.

source: Can't add '%s' to tar file '%s': %s.
ru: Ошибка при добавлении '%s' в tar файл '%s': %s.

source: Can't add file to tar file '%s': %s.
ru: Ошибка при добавлении файла в tar файл '%s': %s.

source: File type of '%s' is not supported.
ru: Тип файла '%s' не поддерживается.

source: Can't close tar file '%s': %s.
ru: Ошибка при закрытии tar файла '%s': %s.

source: Creating tar file '%s' members cache...
ru: Создаем кэш с объектами tar файла '%s'...

source: Members cache has been created.
ru: Кэш с объектами tar файла создан.

source: Can't extract files from tar file '%s' to '%s': %s.
ru: Ошибка при распаковке файлов из tar архива '%s' в '%s': %s.

source: Can't get file '%s' info: %s.
ru: Не удалось получить информацию о файле '%s': %s.

source: Getting tar file '%s' members list...
ru: Получаем список объектов tar файла '%s'...

source: Members list has been gotten.
ru: Список объектов tar файла получен.

source: Opening tar file '%s' with mode '%s'...
ru: Открываем tar файл '%s' в режиме '%s'...

source: Can't open tar file '%s': %s.
ru: Ошибка при открытии tar файла '%s': %s.

source: Tar file has been opened.
ru: Tar файл был успешно открыт.

source: Finding archive with backup data in '%s'...
ru: Поиск архива с данными бэкапа в '%s'...

source: Opening backup '%s' data archive failed.
ru: Не удалось открыть архив бэкапа '%s'.

source: Can't find archive with backup data in '%s'.
ru: Не удалось найти архив с данными бэкапа в '%s'.

source: Archive found: '%s'.
ru: Архив найден: '%s'.

source: Archive type: %s.
ru: Тип архива: %s.

source: Creating tar storage temp directory failed.
ru: Создание временной директории для tar архива завершилось неудачей.

source: Can't extract tar archive '%s' to '%s': %s.
ru: Ошибка при распаковке tar архива '%s' в '%s': %s.

source: Compressing backup data archive...
ru: Сжимаем архив с данными бэкапа...

source: Creating archive '%s' with backup data failed.
ru: Создание архива с данными бэкапа '%s' завершилось неудачей.

source: Tar archive will be used instead of 7z archive.
ru: Вместо 7z архива будет использован tar архив.

source: Uncompressing 7z archive '%s'...
ru: Распаковываем 7z архив '%s'...

source: Uncompressing 7z archive with backup data '%s' to '%s' failed. Shell output: %s
ru: Распаковка 7z архива с данными бэкапа '%s' в '%s' завершилось неудачей. Вывод командной оболочки: %s

source: Uncompressing 7z archive with backup data '%s' failed.
ru: Распаковка 7z архива с данными бэкапа '%s' завершилась неудачей.

source: Uncompressing 7z archive has been finished successfully.
ru: Распаковка 7z архива успешно завершена.

source: Decompressing archive with backup data '%s' to '%s' failed.
ru: Распаковка архива с данными бэкапа '%s' в '%s' завершилась неудачей.

source: Compressing tar archive '%s' to 7z...
ru: Сжимаем tar архив '%s' в 7z архив...

source: Compressing archive with backup data '%s' to 7z failed. Shell output: %s
ru: Сжатие архива с данными бэкапа '%s' в 7z архив завершилось неудачей. Вывод командной оболочки: %s

source: Compressing archive with backup data '%s' to 7z failed.
ru: Сжатие архива с данными бэкапа '%s' в 7z архив завершилось неудачей.

source: Compressing archive to 7z has been finished successfully.
ru: Сжатие архива с данными бэкапа '%s' в 7z архив успешно завершено.

source: Uncompressing archive with backup data '%s'...
ru: Распаковываем сжатый архив с данными бэкапа '%s'...

source: Uncompressing archive finished.
ru: Распаковка сжатого архива успешно завершена.

source: Can't create tar file '%s': %s.
ru: Ошибка при создании tar файла '%s': %s.
